app/Controllers/Admin/EstudianteController.php

SELECT *
FROM `estudiantes`
ORDER BY `id` ASC
---
    public function index()
    {
        $estudiantes = $this->estudiante->orderBy('id', 'ASC')->findAll();

SELECT *
FROM `estudiantes`
WHERE `estudiantes`.`id` = 'dist'
---
    public function show($id = null)
    {
        $estudiante = $this->estudiante->find($id);