app/Controllers/RegistroController.php

SELECT *
FROM `carreras`
SELECT *
FROM `modalidades`
---
    public function new()
    {
        $carreras = model(CarreraModel::class);
        $modalidades = model(ModalidadModel::class);

        $data = [
            'carreras'      => $carreras->findAll(),
            'modalidades'   => $modalidades->findAll()
        ];